<?php
	header("Content-type:text/html;charset=utf-8");

	/*
		位运算符
		 1. & 按位与  左右两边的数字，同一个位置都为1时，则返回1 否则返回0
			101
			110
			返回100，因为只有第一位同为1，后面则不同

		2.| 按位或  	左右两边的数字，同一个位置都为0时，则返回0 否则返回1

		3.^ 按位异或  左右两边的数字，同一个位置数字不同时，则返回1 否则返回0

		4.~ 按位非    将位中的1变成0,0变成1
			如：5的二进制是	000 000 000 000 000 000 000 0101  简写为101
				设$a=       000 000 000 000 000 000 000 0101
				~$a后就变成 	111 111 111 111 111 111 111 1110

		5.<<左移  将左边数的二进制数字按照右边指定数字左移，同时二进制数字右边空位补0
				设$a=       000 000 000 000 000 000 000 0101
				$a<<1     得00 000 000 000 000 000 000 01010
		6.>>右移  将右边数的二进制数字按照左边指定数字右移，同时二进制数字左边空位补0
				设$a=       000 000 000 000 000 000 000 0101
				$a>>1     得0000 000 000 000 000 000 000 010
	*/
		$a=5;
		$b=6;
		// decbin()将10进制变为2进制
		$a=decbin($a);
		// base_convert()同样将10进制变为2进制
		$b=base_convert($b, 10, 2);

		echo $a."<br>".$b."<br>";

		echo "-------------------------------<br>";

		echo $a & $b;
?>